Согра_АЗС/src/DataProcessors/Согра_ЗаправкаТС/Согра_ЗаправкаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Согра_ЗаправкаТС</name>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.Согра_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Согра_Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.Согра_Колонки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Согра_СтатусыКонтроллера</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Согра_АЗС/src/Documents/Согра_Заправка/Согра_Заправка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Согра_Заправка</name>
  <registerRecords>AccumulationRegister.Согра_Заправки</registerRecords>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.Согра_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Согра_Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.Согра_Колонки</types>
    </type>
  </attributes>
</mdclass:Document>

Согра_АЗС/src/DataProcessors/Согра_ЗаправкаТС/Forms/Форма/Module.bsl
&НаСервере
Процедура ТСПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Объект.Водитель = Объект.ТС.Водитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	ТСПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки1НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки1(Команда)
	КомандаВыборКолонки1НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки2НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки2(Команда)
	КомандаВыборКолонки2НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки3НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки3(Команда)
	КомандаВыборКолонки3НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки4НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки4(Команда)
	КомандаВыборКолонки4НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаГотовностьНаСервере()
	
	//Если заправка завершилась, то регистрируем ее в базе
	//Если Тогда
		ЗарегистрироватьЗаправку();
	//КонецЕсли;	


КонецПроцедуры

&НаКлиенте
Процедура КомандаГотовность(Команда)
	КомандаГотовностьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОстановкиОтпускаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаОстановкиОтпуска(Команда)
	КомандаОстановкиОтпускаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗавершитьОтпускНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьОтпуск(Команда)
	КомандаЗавершитьОтпускНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьЗаправку()
	Док = Документы.Согра_Заправка.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	//Док.ВидТоплива = Объект.
	Док.ТС = Объект.ТС;
	Док.Водитель = Объект.Водитель;
	Док.Объем = Объект.Объем;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	
КонецПроцедуры
